import { burger } from '../../../js/burger.js';
import { carousel } from './carousel.js';
import { modal } from '../../../js/modal.js';

burger();
modal();

const viewportWidth = window.innerWidth;

if (viewportWidth >= 1280) {
  carousel();
}
if (viewportWidth < 1280 && viewportWidth >= 768) {
  carousel(2);
}
if (viewportWidth < 768) {
  carousel(1);
}

console.log(`
Реализация burger menu на обеих страницах: +26

Реализация слайдера-карусели на странице Main: 12:
при переключении влево или вправо прокручивается ровно столько карточек, сколько показывается при текущей ширине экрана (3 для 1280px, 2 для 768px, 1 для 320px): +4
каждый новый слайд содержит псевдослучайный набор карточек животных, т.е. формируется из исходных объектов в случайном порядке со следующими условиями:
в текущем блоке слайда карточки с питомцами не повторяются: +4
в следующем блоке нет дублирования карточек с текущим блоком. Например в слайдере из 3 элементов, следующий выезжающий слайд будет содержать 3 (из 8 доступных) новых карточки питомца, таких, каких не было среди 3х карточек на предыдущем уехавшем слайде: +4
сохраняется только одно предыдущее состояние. Т.е. при последовательном переходе два раза влево, а потом два раза вправо, мы получим набор карточек, отличный от исходного: +4
при каждой перезагрузке страницы формируется новая последовательность карточек: +2
генерация наборов карточек происходит на основе 8 объектов с данными о животными: +2
при изменении ширины экрана (от 1280px до 320px и обратно), слайдер перестраивается и работает без перезагрузки страницы (набор карточек при этом может как изменяться, так и оставаться тем же, скрывая лишнюю или добавляя недостающую, и сохраняя при этом описанные для слайдера требования): +4

Реализация попап на обеих страницах: +12
`);
